# 快速开始

<cite>
**本文档引用的文件**  
- [QUICKSTART.md](file://QUICKSTART.md)
- [Cargo.toml](file://Cargo.toml)
- [src/main.rs](file://src/main.rs)
- [src/lexer.rs](file://src/lexer.rs)
- [src/parser/ast.rs](file://src/parser/ast.rs)
- [src/runtime.rs](file://src/runtime.rs)
- [src/api.rs](file://src/api.rs)
- [src/executor/builtin.rs](file://src/executor/builtin.rs)
- [packages/indicators.dp](file://packages/indicators.dp)
</cite>

## 目录
1. [第一步：编译项目](#第一步编译项目)
2. [第二步：理解基本语法](#第二步理解基本语法)
3. [第三步：运行示例](#第三步运行示例)
4. [第五步：编写你的第一个脚本](#第五步编写你的第一个脚本)
5. [第六步：使用包系统](#第六步使用包系统)
6. [常用模式](#常用模式)
7. [调试技巧](#调试技巧)

## 第一步：编译项目

要开始使用 DPLang，首先需要将项目编译为可执行文件。DPLang 使用 Rust 语言开发，因此需要安装 Rust 工具链（如 `cargo`）。

在项目根目录下执行以下命令进行编译：

```bash
cd 
cargo build --release
```

编译成功后，可在 `target/release/` 目录下找到生成的可执行文件 `dplang.exe`。该文件可用于运行 DPLang 脚本。

**Section sources**
- [Cargo.toml](file://Cargo.toml#L1-L15)
- [src/main.rs](file://src/main.rs#L1-L229)

## 第二步：理解基本语法

### 1. 数据脚本结构

DPLang 脚本由特殊的声明语句和逻辑代码组成。每个脚本必须包含 `INPUT` 和 `OUTPUT` 声明，用于定义输入参数和输出结果。

```dplang
-- INPUT 输入参数:类型 --
-- OUTPUT 输出参数:类型 --

# 这里是脚本逻辑
result = input1 + input2

return [result]
```

- `INPUT` 声明定义了脚本接收的输入字段及其数据类型。
- `OUTPUT` 声明定义了脚本将生成的输出字段及其数据类型。
- 脚本主体包含变量赋值、表达式计算和控制流语句。
- `return` 语句用于返回最终结果，必须是一个数组，其元素顺序与 `OUTPUT` 声明一致。

**Section sources**
- [src/lexer.rs](file://src/lexer.rs#L19-L24)
- [src/parser/ast.rs](file://src/parser/ast.rs#L246-L264)
- [src/parser/mod.rs](file://src/parser/mod.rs#L83-L144)

### 2. 支持的数据类型

DPLang 支持以下核心数据类型：

- `number` - 浮点数
- `decimal` - 高精度小数
- `string` - 字符串
- `bool` - 布尔值
- `array` - 数组

这些类型在 `INPUT` 和 `OUTPUT` 声明中使用，确保数据的类型安全。

**Section sources**
- [src/parser/ast.rs](file://src/parser/ast.rs#L207-L214)
- [QUICKSTART.md](file://QUICKSTART.md#L26-L31)

### 3. 常用内置函数

DPLang 提供了丰富的内置函数，涵盖数学、时间序列和调试功能。

**数学函数**：
- `sum(array)` - 求和
- `max(array)` - 最大值
- `min(array)` - 最小值

**时间序列函数**：
- `window("变量名", size)` - 获取滑动窗口数据
- `ref("变量名", offset)` - 引用历史值
- `past("变量名", n)` - 获取过去n个值

**调试函数**：
- `print(...)` - 打印输出

**Section sources**
- [src/executor/builtin.rs](file://src/executor/builtin.rs#L9-L45)
- [QUICKSTART.md](file://QUICKSTART.md#L34-L54)

## 第三步：运行示例

### 示例 1: Hello World

创建文件 `examples/hello.dp`：

```dplang
-- INPUT name:string --
-- OUTPUT greeting:string --

greeting = "Hello, " + name + "!"
print("Greeting:", greeting)

return [greeting]
```

此脚本接收一个名为 `name` 的字符串输入，并生成一个问候语作为输出。`print` 函数用于调试输出。

### 示例 2: 移动平均线

创建文件 `examples/moving_average.dp`：

```dplang
-- INPUT close:number --
-- OUTPUT ma5:number, ma20:number, signal:string --

# 计算5日和20日均线
ma5 = MA(close, 5)
ma20 = MA(close, 20)

# 生成交易信号
signal = ma5 > ma20 ? "金叉" : "死叉"

return [ma5, ma20, signal]
```

该脚本演示了如何处理金融时间序列数据，计算移动平均线并生成交易信号。

### 示例 3: 综合技术分析

创建文件 `examples/technical_analysis.dp`：

```dplang
-- INPUT close:number, high:number, low:number --
-- OUTPUT rsi:number, signal:string --

# 计算RSI指标
rsi = RSI(close, 14)

# 判断超买超卖
signal = rsi < 30 ? "超卖" : 
         rsi > 70 ? "超买" : "中性"

return [rsi, signal]
```

此脚本利用内置的 `RSI` 函数进行技术分析，展示了 DPLang 在量化金融领域的应用。

**Section sources**
- [QUICKSTART.md](file://QUICKSTART.md#L57-L103)
- [packages/indicators.dp](file://packages/indicators.dp#L1-L241)

## 第五步：编写你的第一个脚本

### 场景：计算股票收益率

让我们创建一个名为 `my_first.dp` 的新脚本，用于计算股票的收益率。

```dplang
-- INPUT code:string, open:number, close:number --
-- OUTPUT code:string, 收益率:number, 涨跌:string --

# 计算收益率（百分比）
收益率 = (close - open) / open * 100

# 判断涨跌
涨跌 = 收益率 > 0 ? "上涨" : 
       收益率 < 0 ? "下跌" : "平盘"

# 打印调试信息
print(code, "收益率:", 收益率, "%", 涨跌)

return [code, 收益率, 涨跌]
```

**运行脚本**：

1.  **准备 CSV 输入文件** (`data.csv`)：
    ```csv
    code,open,close
    AAPL,150.0,155.0
    GOOGL,2800.0,2750.0
    ```

2.  **执行命令**：
    ```bash
    dplang run my_first.dp data.csv
    ```

3.  **查看输出**：
    程序将打印调试信息，并以 CSV 格式输出结果，包含股票代码、收益率和涨跌状态。

**Section sources**
- [QUICKSTART.md](file://QUICKSTART.md#L114-L135)
- [src/main.rs](file://src/main.rs#L77-L187)
- [src/api.rs](file://src/api.rs#L145-L191)

## 第六步：使用包系统

DPLang 支持包（package）系统，允许你创建可重用的函数库。

### 创建数学工具包

创建文件 `packages/mymath.dp`：

```dplang
package mymath

# 定义常量
TAU = 6.28318530718

# 定义函数
square(x) -> number:
    return x * x

cube(x) -> number:
    return x * x * x
```

### 使用包

在数据脚本中导入并使用该包：

```dplang
-- IMPORT mymath --
-- INPUT x:number --
-- OUTPUT result:number --

result = mymath.square(x) + mymath.TAU
return [result]
```

通过 `-- IMPORT mymath --` 声明，你可以访问 `mymath` 包中定义的所有函数和常量。

**Section sources**
- [QUICKSTART.md](file://QUICKSTART.md#L137-L166)
- [src/lexer.rs](file://src/lexer.rs#L21-L23)
- [src/parser/ast.rs](file://src/parser/ast.rs#L257)
- [src/parser/mod.rs](file://src/parser/mod.rs#L95-L103)

## 常用模式

### 1. 条件判断

```dplang
if price > 100:
    signal = "高价"
else:
    signal = "低价"
```

### 2. 三元表达式

```dplang
signal = price > 100 ? "高价" : "低价"
```

### 3. 数组操作

```dplang
prices = [100, 200, 300]
doubled = map(prices, x -> x * 2)
filtered = filter(prices, x -> x > 150)
```

### 4. 向量运算

```dplang
prices = [100, 200, 300]
adjusted = prices * 1.1  # 全部上涨10%
```

### 5. 时间序列计算

```dplang
# 获取前一天的收盘价
prev_close = close[-1]

# 计算涨跌幅
change = prev_close == null ? 0 : (close - prev_close) / prev_close * 100
```

**Section sources**
- [QUICKSTART.md](file://QUICKSTART.md#L168-L208)

## 调试技巧

### 使用 print 函数

`print` 函数是调试脚本最直接的方法。

```dplang
print("变量值:", x, y, z)
print("数组:", prices)
print("计算结果:", ma5, ma20)
```

它会将参数的值输出到控制台，帮助你理解脚本的执行流程。

### 检查 null 值

在处理时间序列数据时，历史数据可能不足，导致返回 `null`。务必进行检查：

```dplang
if value == null:
    print("警告: 值为空")
else:
    print("正常值:", value)
```

**Section sources**
- [QUICKSTART.md](file://QUICKSTART.md#L217-L234)
- [src/executor/builtin.rs](file://src/executor/builtin.rs#L273-L282)